app/controllers/alphas_controller.rb

  def create
     @alpha = Alpha.new(params[:alpha])

     respond_to do |format|
       if @alpha.email.size > 0
         if @alpha.save
---
INSERT INTO `alphas` (`email`, `created_at`, `updated_at`) VALUES ('me@andreaslengyel.net', '2011-07-07 04:12:45', '2011-07-07 04:12:45')