app/controllers/teachers_controller.rb

SELECT `teachers`.* FROM `teachers` WHERE `teachers`.`url` = 'alpha' LIMIT 1
---
  def profile
    @teacher = Teacher.find_by_url(params[:url])